-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- 主機： 127.0.0.1
-- 產生時間： 2023-07-19 20:08:35
-- 伺服器版本： 10.4.28-MariaDB
-- PHP 版本： 8.2.4

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 資料庫： `coffseeker_db`
--

-- --------------------------------------------------------

--
-- 資料表結構 `coupon`
--

CREATE TABLE `coupon` (
  `coupon_id` int(5) NOT NULL,
  `coupon_name` text NOT NULL,
  `coupon_code` varchar(10) NOT NULL,
  `coupon_valid` tinyint(4) NOT NULL,
  `valid_description` varchar(255) NOT NULL,
  `discount_type` text NOT NULL,
  `discount_value` varchar(10) NOT NULL,
  `start_at` date NOT NULL,
  `expires_at` date NOT NULL,
  `created_at` date NOT NULL,
  `updated_at` date NOT NULL,
  `max_usage` int(5) NOT NULL,
  `used_times` int(5) NOT NULL,
  `price_min` int(11) NOT NULL,
  `usage_restriction` varchar(50) NOT NULL,
  `user_id` int(10) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- 傾印資料表的資料 `coupon`
--

INSERT INTO `coupon` (`coupon_id`, `coupon_name`, `coupon_code`, `coupon_valid`, `valid_description`, `discount_type`, `discount_value`, `start_at`, `expires_at`, `created_at`, `updated_at`, `max_usage`, `used_times`, `price_min`, `usage_restriction`, `user_id`) VALUES
(2, '春暖花開', 'fsdfaa', 0, '已刪除', '金額', '30', '2023-07-19', '2023-07-28', '2023-07-11', '2023-07-11', 10, 0, 100, '限定商店使用', 0),
(3, '現金折價卷', 'fsdfaa', 0, '已刪除', '金額', '30', '2023-07-19', '2023-08-24', '2023-07-11', '2023-07-16', 1, 0, 100, '資策會限定', 0),
(4, '買一送一卷', 'VKARK445a', -1, '已停用', '百分比', '50%', '2023-06-26', '2023-06-29', '2023-07-11', '2023-07-19', 3, 0, 100, '想望咖啡', 0),
(5, '外送免運卷', 'rjofkjo816', 1, '可使用', '金額', '50', '2023-07-20', '2023-07-27', '2023-07-11', '2023-07-19', 5, 0, 100, 'PR咖啡', 0),
(6, '外送免運卷', 'rjofkja816', 0, '已刪除', '金額', '30', '2023-07-19', '2023-07-27', '2023-07-11', '2023-07-11', 15, 0, 100, '炎炎夏日', 0),
(7, '外送免運卷', 'rjofkja816', 0, '已刪除', '金額', '3', '2023-07-21', '2023-07-27', '2023-07-11', '2023-07-19', 5, 0, 200, 'PR咖啡', 0),
(8, '春光佐茶', 'Ed875daA95', 1, '可使用', '百分比', '100%', '2023-07-19', '2023-07-28', '2023-07-11', '2023-07-19', 1, 0, 100, 'PR咖啡', 0),
(9, '春暖花開', 'EAFASF5412', -1, '已停用', '百分比', '99%', '2023-07-19', '2023-07-20', '2023-07-11', '2023-07-19', 1, 0, 200, '想望咖啡', 0),
(10, '春暖花開', 'KLPcoXwYSQ', 0, '已刪除', '金額', '200', '2023-07-18', '2023-08-03', '2023-07-12', '2023-07-19', 1, 0, 100, 'PR咖啡', 0),
(11, '外送好事多', 'UnNqaTu1oX', -1, '已停用', '金額', '10', '2023-07-19', '2023-08-03', '2023-07-16', '2023-07-16', 1, 0, 100, '春暖花開', 0),
(12, '週末逛大街', 'ziLHYA6dOM', -1, '已停用', '金額', '50', '2023-07-19', '2023-08-04', '2023-07-16', '2023-07-16', 1, 0, 100, '夏季大賞', 0),
(13, '週末喝咖啡', 'xJd5lik9Ta', 1, '可使用', '百分比', '2%', '2023-07-19', '2023-08-19', '2023-07-16', '2023-07-16', 1, 0, 100, '夏季大賞', 0),
(14, '週末下午茶', 'ntuAVo3wj8', -1, '已停用', '金額', '799', '2023-07-19', '2023-08-04', '2023-07-16', '2023-07-19', 1, 0, 10000, 'PR咖啡', 0),
(15, '週末逛大街', 'jsOsuTnnm7', 1, '可使用', '金額', '300', '2023-07-19', '2023-08-04', '2023-07-16', '2023-07-16', 1, 0, 100, '夏季大賞', 0),
(16, '外送好事多', 'KtiRPP3RVQ', 1, '可使用', '金額', '300', '2023-07-19', '2023-07-29', '2023-07-16', '2023-07-16', 1, 0, 100, '單筆消費滿10000', 0),
(17, '春暖花開', 'xAmJxhhjPx', 1, '可使用', '百分比', '2%', '2023-07-19', '2023-08-03', '2023-07-16', '2023-07-16', 1, 0, 100, '單筆消費滿10000', 0),
(18, '春暖花開', 'LI2FM5MBhU', -1, '已停用', '百分比', '2%', '2023-07-19', '2023-08-03', '2023-07-16', '2023-07-16', 4, 0, 100, '單筆消費滿10000', 0),
(19, '春暖花開', 'LI2FM5MBhU', 0, '已刪除', '百分比', '2%', '2023-07-19', '2023-08-03', '2023-07-16', '2023-07-16', 4, 0, 100, '單筆消費滿10000', 0),
(20, '週末逛大街', 'xg06hv9OAr', -1, '已停用', '金額', '100', '2023-07-19', '2023-08-03', '2023-07-16', '2023-07-16', 4, 0, 100, '單筆消費滿10000', 0),
(21, '陽光海灘', '2hvHh9RFQp', 1, '可使用', '金額', '200', '2023-07-01', '2023-07-20', '2023-07-19', '2023-07-19', 2, 0, 500, '薩圖爾精品咖啡', 0),
(22, '春暖花開', 'yyigUl7qPq', 1, '可使用', '金額', '300', '2023-07-19', '2023-08-05', '2023-07-19', '2023-07-19', 2, 0, 500, '黑浮咖啡', 0),
(23, '春暖花開', 'ID8rHaGfjW', 1, '可使用', '百分比', '2%', '2023-07-19', '2023-07-31', '2023-07-19', '2023-07-19', 1, 0, 100, 'PR咖啡', 0),
(24, '春暖花開', 'CY46ALIfDM', -1, '已停用', '百分比', '2%', '2023-07-20', '2023-08-05', '2023-07-19', '2023-07-19', 4, 0, 100, '奎克咖啡', 0),
(25, '春暖花開', 'Ly4WYG5xEV', 1, '可使用', '百分比', '5%', '2023-07-20', '2023-07-20', '2023-07-19', '2023-07-19', 4, 0, 500, '奎克咖啡', 0),
(26, '春暖花開', 'Pc29j2acwD', -1, '已停用', '百分比', '2%', '2023-07-12', '2023-07-15', '2023-07-19', '2023-07-19', 1, 0, 200, '薩圖爾精品咖啡', 0),
(27, '春暖花開', 'mknxQIzIz5', -1, '已停用', '百分比', '2%', '2023-07-12', '2023-07-15', '2023-07-19', '2023-07-19', 2, 0, 500, '黑浮咖啡', 0),
(28, '春暖花開', 'Zy65RvfDgE', -1, '已停用', '百分比', '2%', '2023-07-16', '2023-07-18', '2023-07-19', '2023-07-19', 1, 0, 200, '哈本咖啡 Happen Coffee', 0),
(29, '外送免運卷', 'cTq2xTFzha', -1, '已停用', '百分比', '2%', '2023-07-20', '2023-07-27', '2023-07-19', '2023-07-19', 1, 0, 500, 'JC咖啡', 0),
(30, '週末逛大街', 'WcHL2RGNF4', -1, '已停用', '百分比', '2%', '2023-06-25', '2023-06-30', '2023-07-19', '2023-07-19', 4, 0, 500, 'Simple Kaffa 興波咖啡', 0),
(31, '週末逛大街', 'faacnZqSAn', -1, '已停用', '金額', '100', '2023-07-02', '2023-07-06', '2023-07-19', '2023-07-19', 1, 0, 222, 'Simple Kaffa 興波咖啡', 0),
(32, '春暖花開', 'ovAs7ytNFV', -1, '已停用', '百分比', '2%', '2023-06-27', '2023-06-30', '2023-07-19', '2023-07-19', 5, 0, 500, 'Simple Kaffa 興波咖啡', 0),
(33, '春暖花開', 'Ap5BqLt7Im', -1, '已停用', '金額', '200', '2023-07-03', '2023-07-05', '2023-07-19', '2023-07-19', 2, 0, 500, 'CoFeel凱飛', 0),
(34, '週末下午茶', 't4CHneNeMF', -1, '已停用', '百分比', '5%', '2023-06-27', '2023-07-01', '2023-07-19', '2023-07-19', 4, 0, 200, 'Simple Kaffa 興波咖啡', 0);

--
-- 已傾印資料表的索引
--

--
-- 資料表索引 `coupon`
--
ALTER TABLE `coupon`
  ADD PRIMARY KEY (`coupon_id`);

--
-- 在傾印的資料表使用自動遞增(AUTO_INCREMENT)
--

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `coupon`
--
ALTER TABLE `coupon`
  MODIFY `coupon_id` int(5) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=35;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
